abcdaaa1111/ArduinoCore-zephyr/boards.txt
unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##########################################################################################

pico.name=Raspberry Pi Pico
pico.build.core=arduino
pico.build.crossprefix=arm-zephyr-eabi-
pico.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

pico.menu.debug.false=Standard
pico.menu.debug.true=Debug
pico.menu.debug.true.build.zsk_args.debug=-debug

pico.menu.link_mode.dynamic=Dynamic
pico.menu.link_mode.static=Static
pico.menu.link_mode.static.build.link_mode=static
pico.menu.link_mode.static.upload.extension=bin-zsk.bin

pico.build.zephyr_target=rpi_pico
pico.build.zephyr_args=
pico.build.zephyr_hals=hal_rpi_pico
pico.build.artifact=zephyr_main
pico.build.variant=rpi_pico_rp2040
pico.build.mcu=cortex-m0plus
pico.build.fpu=
pico.build.architecture=cortex-m0plus

pico.build.float-abi=
pico.build.extra_flags=
pico.build.board=RASPBERRY_PI_PICO
pico.vid.0=0x2e8a
pico.pid.0=0x000a
pico.upload_port.0.vid=0x2e8a
pico.upload_port.0.pid=0x0003

pico.upload.tool=picotool
pico.upload.tool.default=picotool
pico.upload.protocol=
pico.upload.transport=
pico.upload.vid=0x2e8a
pico.upload.pid=0x0003
pico.upload.interface=0
pico.upload.use_1200bps_touch=false
pico.upload.wait_for_upload_port=false
pico.upload.native_usb=true
pico.upload.maximum_size=2093056
pico.upload.maximum_data_size=262144

pico.bootloader.tool=picotool
pico.bootloader.tool.default=picotool
pico.bootloader.file=zephyr-{build.variant}.uf2

pico.debug.tool=gdb
pico.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
pico.debug.server.openocd.scripts.1={programmer.transport_script}
pico.debug.server.openocd.scripts.2=target/rp2040.cfg
pico.debug.cortex-debug.custom.request=attach

##########################################################################################

sf32lb52devkitlcd.name=SiFli SF32LB52 DevKit LCD
sf32lb52devkitlcd.build.core=arduino
sf32lb52devkitlcd.build.crossprefix=arm-zephyr-eabi-
sf32lb52devkitlcd.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

sf32lb52devkitlcd.menu.debug.false=Standard
sf32lb52devkitlcd.menu.debug.true=Debug
sf32lb52devkitlcd.menu.debug.true.build.zsk_args.debug=-debug

sf32lb52devkitlcd.menu.link_mode.dynamic=Dynamic
sf32lb52devkitlcd.menu.link_mode.static=Static
sf32lb52devkitlcd.menu.link_mode.static.build.link_mode=static
sf32lb52devkitlcd.menu.link_mode.static.upload.extension=bin-zsk.bin

sf32lb52devkitlcd.build.zephyr_target=sf32lb52_devkit_lcd
sf32lb52devkitlcd.build.zephyr_args=
sf32lb52devkitlcd.build.zephyr_hals=hal_sifli
sf32lb52devkitlcd.build.artifact=zephyr_contrib
sf32lb52devkitlcd.build.variant=sf32lb52_devkit_lcd_sf32lb525uc6
sf32lb52devkitlcd.build.mcu=cortex-m33
sf32lb52devkitlcd.build.fpu=
sf32lb52devkitlcd.build.architecture=cortex-m33

sf32lb52devkitlcd.build.float-abi=
sf32lb52devkitlcd.build.extra_flags=
sf32lb52devkitlcd.build.board=SF32LB52_DEVKIT_LCD
sf32lb52devkitlcd.upload.extension=elf-zsk.bin
sf32lb52devkitlcd.upload.address=0x12110000

sf32lb52devkitlcd.upload.tool=sifli
sf32lb52devkitlcd.upload.tool.default=sifli
sf32lb52devkitlcd.upload.protocol=
sf32lb52devkitlcd.upload.transport=
sf32lb52devkitlcd.upload.interface=0
sf32lb52devkitlcd.upload.use_1200bps_touch=false
sf32lb52devkitlcd.upload.wait_for_upload_port=false
sf32lb52devkitlcd.upload.native_usb=false
sf32lb52devkitlcd.upload.maximum_size=16711680
sf32lb52devkitlcd.upload.maximum_data_size=524288

sf32lb52devkitlcd.bootloader.tool=sifli
sf32lb52devkitlcd.bootloader.tool.default=sifli
sf32lb52devkitlcd.bootloader.file=zephyr-{build.variant}.bin
sf32lb52devkitlcd.bootloader.target=sf32lb52

##########################################################################################
